## LONDON HOUSING DATASET


The London Housing Dataset primarily focuses on the housing market within London, offering a comprehensive array of pertinent data. The dataset encompasses various key aspects, including:

- Monthly average house prices
- Yearly number of houses sold
- Monthly number of reported crimes

The data spans from the year 1995 to 2019, encompassing different areas within London. Acquired from Kaggle, this dataset is conveniently available in CSV format. For our analysis, we employ the powerful Pandas DataFrame, a crucial tool for handling and manipulating structured data in Python.

This project caters to individuals at the beginner level, providing valuable insights into the intricacies of analyzing substantial datasets using Python. We have curated a set of sample questions, designed to guide our exploration and derive meaningful insights from thithin each group.s dataset.

- import pandas as pd: Utilized to import the Pandas library for efficient data manipulation and analysis.
- pd.read_csv: Employed to read and import a CSV file into a Jupyter notebook, facilitating data access.
- df.count(): Utilized to count the number of non-null values for each column within the DataFrame.
- df.isnull().sum(): Implemented to detect and quantify missing values present in the DataFrame.
- import seaborn as sns: Employed to import the Seaborn library, aiding in statistical data visualization.
- import matplotlib.pyplot as plt: Utilized to import the Matplotlib library, essential for creating visualizations and plots.
- sns.heatmap(df.isnull()): Employed to display a heatmap representing missing values in the DataFrame, aiding in data quality assessment.
- plt.show(): Utilized to display the plot or visualization created using Matplotlib.
- df.dtypes: Utilized to display the datatype of each column in the DataFrame.
- pd.to_datetime(df.Date_Time_Col): Employed to convert the datatype of a Date-Time column into the datetime[ns] datatype.
- df.Time_Col.dt.year: Utilized to create a new column with only year values.
- df.Time_Col.dt.month: Employed to create a new column with only month values.
- df.insert(index, 'new_column_name', new_column_values): Used to insert a new column at a specific position with defined values.
- df.drop(['Col_name'], axis=1, inplace=True): Employed to permanently remove a specified column from the DataFrame.
- df.groupby('Col_name'): Utilized to form groups based on all unique values within a specified column.
- df[df.Col_1 == 'Element1']: Employed for filtering, specifically accessing records where Col_1 equals 'Element1'.
- df.groupby('Col_1')['Col_2'].mean(): Used to create groups based on Col_1 and calculate the mean of Col_2 within each group.

In [1]:
import pandas as pd

In [3]:
housing = pd.read_csv(r"Data/LondonHousingData.csv")

In [4]:
housing

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN
...,...,...,...,...,...,...
13544,9/1/2019,england,249942,E92000001,64605.0,NaN
13545,10/1/2019,england,249376,E92000001,68677.0,NaN
13546,11/1/2019,england,248515,E92000001,67814.0,NaN
13547,12/1/2019,england,250410,E92000001,NaN,NaN
13548,1/1/2020,england,247355,E92000001,NaN,NaN

## Convert Date Column Datatype:

Question: Convert the datatype of the 'Date' column to the Date-Time format.

## Create Year and Month Columns:

Question 2A: Add a new column 'year' containing only the years.
Question 2B: Add a new column 'month' as the second column in the dataframe, containing only the months.

## Remove Year and Month Columns:

Question: Remove the 'year' and 'month' columns from the dataframe.

## Records with Zero Crimes:

Question: Display all records where the 'No. of Crimes' is 0. How many such records are there?

## Maximum and Minimum Average Price per Year in England:

Question: Determine the maximum and minimum 'average_price' per year in England.

## Maximum and Minimum No. of Crimes per Area:

Question: Determine the maximum and minimum number of crimes recorded per area.

## Count of Records per Area with Average Price Below 100000:

Question: Show the total count of records for each area where the average price is less than 100000.